revk/ESP32-Flasher/main/Flasher.c
const char *
load_manifest (void)
{
   close_manifest ();
   char *fn = NULL;
   asprintf (&fn, "%s/manifest%d.json", sd_dir, manifest);
   int f = open (fn, O_RDONLY);
   if (f < 0)
   {
      free (fn);
      return "Failed to open";
   }
   struct stat s = { 0 };
   fstat (f, &s);
   if (!s.st_size || s.st_size > 10000)
   {                            // Silly
      close (f);
      free (fn);
      return "Silly size";
   }
   manifestjson = malloc (s.st_size);
   if (!manifestjson)
   {
      close (f);
      free (fn);
      return "Malloc fail";
   }
   if (read (f, manifestjson, s.st_size) != s.st_size)
   {
      close (f);
      free (manifestjson);
      manifestjson = NULL;
      free (fn);
      return "Read fail";
   }
   j = jo_parse_mem (manifestjson, s.st_size);
   if (!j)
   {
      close (f);
      free (manifestjson);
      manifestjson = NULL;
      free (fn);
      return "Bad JSON";
   }
   b.manifestidprefix = 0;
#define x(i) free (manifest##i); manifest##i = NULL; if (jo_find (j, #i)) manifest##i = jo_strdup (j);
   x (id);
   x (version);
   x (build);
   x (setting);
   x (start);
   x (pass);
   x (fail);
#undef x
   b.erase = (jo_find (j, "erase") == JO_TRUE);
   b.nobtn = (jo_find (j, "button") == JO_FALSE);
   b.nocheck = (jo_find (j, "check") == JO_FALSE);
   b.voltage3v3 = 0;
   if (jo_find (j, "voltage") == JO_NUMBER)
   {
      int v = round (1000 * jo_read_float (j));
      if (v == 3300)
         b.voltage3v3 = 1;
      else if (v != 5000)
         b.fileerror = 1;
   }
   if (!b.checked && !revk_link_down () && time (0) > 1000000000)
   {                            // Can check for new files
      if (jo_find (j, "url") == JO_STRING)
      {
         char *url = jo_strdup (j);
         upgrade_check (fn, url);
         free (url);
      }
      close (f);
      free (fn);
      manifestsize = 0;
      scan_manifest (upgrade_cb);
      if (client)
      {
         esp_http_client_cleanup (client);
         client = NULL;
      }
      if (!b.reload)
         b.checked = 1;
   } else
   {
      close (f);
      free (fn);
      scan_manifest (load_cb);
   }
   if (manifestsize == -1)
      return "Missing files";
   if (!manifestsize)
      return "No files to flash";
   return NULL;
}

esp_loader_error_t
do_erase (void)
{
   b.forceerase = 0;
   ESP_LOGE (TAG, "Erase whole flash");
   uint32_t p = 0;
   while (p < flashsize && !b.reload)
   {
      set_led (p * 100 / flashsize, 'B', 'K');
      esp_loader_error_t e = esp_loader_flash_erase_region (p, BLOCK);
      if (e)
         return e;
      p += BLOCK;
   }
   return 0;
}

uint32_t flashcount = 0;
esp_loader_error_t flashe = 0;
void
flash_cb (char *fn, char *url, int app, uint32_t address, uint32_t size)
{
   if (!fn)
      return;
   char *filename = fn + sizeof (sd_dir);
   ESP_LOGE (TAG, "Flash to %06X len %06X %s", address, size, filename);
   if (flashe || !size)
      return;
   int f = open (fn, O_RDONLY);
   if (f < 0)
   {
      ESP_LOGE (TAG, "Missing %s", filename);
      return;
   }
   flashe = esp_loader_flash_start (address, (size + BLOCK - 1) / BLOCK * BLOCK, BLOCK);
   if (!flashe)
   {
      uint32_t p = 0;
      while (p < size)
      {
         set_led (flashcount * 100 / manifestsize, 'K', 'B');
         uint32_t s = read (f, block, BLOCK);
         if (s <= 0)
            break;
         p += s;
         flashcount += s;
         while (s < BLOCK)
            block[s++] = 0xFF;
         flashe = esp_loader_flash_write (block, s);
         if (flashe)
            break;
      }
   }
   close (f);
   if (!flashe)
      flashe = esp_loader_flash_finish (false);
   if (!flashe)
      flashe = esp_loader_flash_verify ();
   if (flashe)
      ESP_LOGE (TAG, "Flash fail %06X len %06X %s %s", address, size, filename, esp_err_to_name (flashe));
}

esp_loader_error_t
do_flash (void)
{
   ESP_LOGE (TAG, "Flash %u bytes", manifestsize);
   flashe = 0;
   flashcount = 0;
   scan_manifest (flash_cb);
   return flashe;
}

void
flash_task (void *arg)
{
   esp_err_t e = 0;
   // SD card set up
   revk_gpio_input (sdcd);
   sdmmc_card_t *card = NULL;
   sdmmc_slot_config_t slot = SDMMC_SLOT_CONFIG_DEFAULT ();
   sdmmc_host_t host = SDMMC_HOST_DEFAULT ();
   slot.clk = sdclk.num;
   slot.cmd = sdcmd.num;
   slot.d0 = sddat0.num;
   slot.d1 = sddat1.set ? sddat1.num : -1;
   slot.d2 = sddat2.set ? sddat2.num : -1;
   slot.d3 = sddat3.set ? sddat3.num : -1;
   slot.width = (sddat2.set && sddat3.set ? 4 : sddat1.set ? 2 : 1);
   if (slot.width == 1)
      slot.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;    // Old boards?
   host.max_freq_khz = SDMMC_FREQ_HIGHSPEED;
   host.slot = SDMMC_HOST_SLOT_1;
   {                            // USB init
      const usb_host_config_t host_config = {
         .skip_phy_setup = false,
         .intr_flags = ESP_INTR_FLAG_LEVEL1,
      };
      cdc_acm_host_driver_config_t usb_config = {
         .driver_task_priority = 10,
         .driver_task_stack_size = 4096,
         .xCoreID = 0,
         .new_dev_cb = device_connect_cb,
      };
      e = usb_host_install (&host_config);
      if (!e)
         e = cdc_acm_host_install (&usb_config);
      if (e)
      {
         ledsd = 'R';
         ESP_LOGE (TAG, "USB init failed %s", esp_err_to_name (e));
         jo_t j = jo_object_alloc ();
         jo_string (j, "error", esp_err_to_name (e));
         jo_int (j, "code", e);
         revk_error ("USB", &j);
      }
   }
   revk_task ("usb-lib", usb_lib_task, NULL, 4);
   // Main loop
   while (!b.die && !revk_shutting_down (NULL))
   {
      ledsd = 'Y';
      ESP_LOGI (TAG, "Waiting SD");
      // Wait for SD card
      while (!revk_gpio_get (sdcd))
      {
         b.checked = 0;
         usleep (100000);
         continue;
      }
      ESP_LOGI (TAG, "Mounting SD");
      // Mount SD card
      esp_vfs_fat_sdmmc_mount_config_t mount_config = {
         .format_if_mount_failed = 1,
         .max_files = 2,
         .allocation_unit_size = 16 * 1024,
         .disk_status_check_enable = 1,
      };
      e = esp_vfs_fat_sdmmc_mount (sd_dir, &host, &slot, &mount_config, &card);
      if (e != ESP_OK)
      {
         ledsd = 'R';
         ESP_LOGE (TAG, "SD mount failed %s", esp_err_to_name (e));
         jo_t j = jo_object_alloc ();
         if (e == ESP_FAIL)
            jo_string (j, "error", "Failed to mount");
         else
            jo_string (j, "error", "Failed to initialise");
         jo_int (j, "code", e);
         revk_error ("SD", &j);
         while (revk_gpio_get (sdcd))
            usleep (100000);
         continue;
      }
      ESP_LOGI (TAG, "Mounted SD");
      ledsd = 'G';
      b.fileerror = 0;
      set_led (manifest * 10, 'Y', 'Y');
      {                         // Check manifests
         manifests = 0;
         for (int i = 0; i < 10; i++)
         {
            char *fn;
            asprintf (&fn, "%s/manifest%d.json", sd_dir, i);
            if (!access (fn, R_OK))
               manifests |= (1 << i);
         }
      }
      {                         // Manifest
         const char *e = load_manifest ();
         if (e)
         {
            ESP_LOGE (TAG, "Manifest fail: %s", e);
            set_led (manifest * 10, 'R', 'R');
            b.fileerror = 1;
         }
      }

      if (!b.fileerror)
      {
         // TODO how do we do serial via UART?
         ESP_LOGE (TAG, "Power on %s", b.voltage3v3 ? "3.3V" : "5V");
         revk_gpio_output (b.voltage3v3 ? pwr3 : pwr5, 1);      // device on
         usb_host_lib_set_root_port_power (true);
         while (revk_gpio_get (sdcd) && !b.die && !b.reload && !revk_shutting_down (NULL))
         {
            b.fileerror = 0;
            if (badusb && badusb + 2 > uptime ())
               set_led (manifest * 10, 'R', 'R');       // Likely diff device
            else
               set_led (manifest * 10, 'M', 'M');
            if (b.wifi && time (0) > 1000000000)
            {
               ESP_LOGE (TAG, "Online");
               b.wifi = 0;
               revk_command ("upgrade", NULL);
               b.reload = 1;
               continue;
            }
            if (!b.connected)
            {
               usleep (100000);
               continue;
            }
            loader_esp32_usb_cdc_acm_config_t config = {
               .acm_host_error_callback = host_error_cb,
               .device_disconnected_callback = device_disconnect_cb,
               .device_pid = 0x1001,    // USB direct not serial chip...
               .connection_timeout_ms = 1000,
               .out_buffer_size = BLOCK,
               //.acm_host_serial_state_callback = host_serial_cb,
            };
            esp_loader_error_t e = loader_port_esp32_usb_cdc_acm_init (&config);
            if (e)
            {                   // try non JTAG
               config.device_pid = 0;
               e = loader_port_esp32_usb_cdc_acm_init (&config);
            }
            if (!e)
            {                   // Connected
               set_led (manifest * 10, 'O', 'O');
               uint8_t status = STATUS_TIMEOUT;
               if (!b.forceerase && !b.erase && !b.nocheck)
               {
                  esp_loader_reset_target ();
                  status = target_status ();
               }
               if (b.connected
                   && (b.forceerase || b.erase || (status != STATUS_PASS && status != STATUS_FAIL)) && status != STATUS_ERROR)
               {
                  ESP_LOGE (TAG, "Bootload");
                  esp_loader_connect_args_t a = ESP_LOADER_CONNECT_DEFAULT ();
                  e = esp_loader_connect_with_stub (&a);        // Some chips don't work with stub
                  if (e)
                  {
                     ESP_LOGE (TAG, "Failed to connect in downloader mode");
                     status = STATUS_ERROR;
                  }
                  if (status != STATUS_ERROR)
                     chip_info ();
                  if (status != STATUS_ERROR && !flashsize)
                  {
                     ESP_LOGE (TAG, "Failed to get chip info");
                     status = STATUS_ERROR;
                  }
                  if (status != STATUS_ERROR && jo_find (j, "chip") == JO_STRING && jo_strcmp (j, chip))
                  {
                     status = STATUS_ERROR;
                     char *c = jo_strdup (j);
                     ESP_LOGE (TAG, "Wrong chip %s expecting %s", chip, c);
                     free (c);
                     b.fileerror = 1;
                  }
                  if ((b.forceerase || b.erase) && status != STATUS_EMPTY && status != STATUS_ERROR && do_erase ())
                  {
                     status = STATUS_ERROR;
                     ESP_LOGE (TAG, "Erase failed");
                  }
                  if (status != STATUS_ERROR && do_flash ())
                  {
                     status = STATUS_ERROR;
                     ESP_LOGE (TAG, "Flash failed");
                  }
                  if (b.connected && !b.reload)
                  {
                     ESP_LOGE (TAG, "Reset");
                     esp_loader_reset_target ();
                     status = target_status ();
                  }
               }
               switch (status)
               {
               case STATUS_MISMATCH:
                  set_led (10, 'K', 'Y');
                  break;
               case STATUS_PASS:
                  set_led (100, 'K', 'G');
                  break;
               case STATUS_FAIL:
                  set_led (100, 'K', 'R');
                  break;
               case STATUS_LOOPING:
                  set_led (90, 'K', 'R');
                  break;
               case STATUS_SILENT:
                  set_led (80, 'K', 'R');
                  break;
               case STATUS_EMPTY:
                  set_led (70, 'K', 'R');
                  break;
               case STATUS_ERROR:
                  b.fileerror = 1;
                  set_led (60, 'K', 'R');
                  break;
               case STATUS_TIMEOUT:
                  set_led (50, 'R', 'G');
                  break;
               default:
                  set_led (manifest * 10, 'R', 'R');
               }
               if (b.connected && !b.reload)
               {
                  ESP_LOGE (TAG, "Wait disconnect");
                  while (revk_gpio_get (sdcd) && b.connected && !b.reload && !revk_shutting_down (NULL))
                     usleep (100000);
               }
            }
            close_manifest ();
            loader_port_esp32_usb_cdc_acm_deinit ();
         }
         set_led (0, 'K', 'K');
         ESP_LOGE (TAG, "Power off");
         if (b.connected)
            usb_host_lib_set_root_port_power (false);
         revk_gpio_output (pwr3, 0);
         revk_gpio_output (pwr5, 0);
      } else
         sleep (1);
      ESP_LOGI (TAG, "Dismounting SD");
      esp_vfs_fat_sdcard_unmount (sd_dir, card);
      ledsd = 'B';
      b.reload = 0;
   }

   usb_host_uninstall ();
   b.fileerror = 0;
   while (revk_shutting_down (NULL))
   {
      int p = revk_ota_progress ();
      if (p >= 0 && p <= 100)
         set_led (p, 'K', 'Y');
      usleep (100000);
   }
   vTaskDelete (NULL);
}

//--------------------------------------------------------------------------------
// Main
void
app_main ()
{
   revk_boot (&mqtt_client_callback);
   revk_start ();
   revk_gpio_output (pwr3, 0);
   revk_gpio_output (pwr5, 0);
   {                            // LED
      led_strip_config_t strip_config = {
         .strip_gpio_num = led.num,
         .max_leds = 11,
         .color_component_format = LED_STRIP_COLOR_COMPONENT_FMT_GRB,
         .led_model = LED_MODEL_WS2812, // LED strip model
         .flags.invert_out = led.invert,
      };
      led_strip_rmt_config_t rmt_config = {
         .clk_src = RMT_CLK_SRC_DEFAULT,        // different clock source can lead to different power consumption
         .resolution_hz = 10 * 1000 * 1000,     // 10 MHz
      };
#ifdef	CONFIG_IDF_TARGET_ESP32S3
      rmt_config.flags.with_dma = true;
#endif
      REVK_ERR_CHECK (led_strip_new_rmt_device (&strip_config, &rmt_config, &strip));
      revk_task ("led", led_task, NULL, 4);
   }
   revk_gpio_input (btn);
   revk_task ("btn", btn_task, NULL, 4);
   revk_task ("flash", flash_task, NULL, 16);
}
